# Uniendo DataFrames usando join

In [1]:
import pandas as pd

Primero, vamos a crear los DataFrames.

In [5]:
left = pd.DataFrame({
    key: [key + str(value) for value in range(0, 4)] for key in ['a', 'b', 'c']
}, index=['k' + str(value) for value in range(0, 4)])
left

     a   b   c
k0  a0  b0  c0
k1  a1  b1  c1
k2  a2  b2  c2
k3  a3  b3  c3

In [17]:
right = pd.DataFrame({
    key: [key + str(value) for value in range(0, 4)] for key in ['d', 'f', 'g']
}, index=['k' + str(value) for value in range(0, 7, 2)])
right

     d   f   g
k0  d0  f0  g0
k2  d1  f1  g1
k4  d2  f2  g2
k6  d3  f3  g3

Aqu√≠ vamos a ver el left join (por defecto), y como debido a que no todos los registros del conjunto `left` cuentan con las columnas `d`, `f`, y `g`, se producen nulos.

In [18]:
left.join(right)

     a   b   c    d    f    g
k0  a0  b0  c0   d0   f0   g0
k1  a1  b1  c1  NaN  NaN  NaN
k2  a2  b2  c2   d1   f1   g1
k3  a3  b3  c3  NaN  NaN  NaN

Podemos ver que esto mismo ocurre si hacemos un right join.

In [22]:
left.join(right, how='right')

      a    b    c   d   f   g
k0   a0   b0   c0  d0  f0  g0
k2   a2   b2   c2  d1  f1  g1
k4  NaN  NaN  NaN  d2  f2  g2
k6  NaN  NaN  NaN  d3  f3  g3

O si queremos vivir la vida loca y traernos todos los datos, un outer join.

In [23]:
left.join(right, how='outer')

      a    b    c    d    f    g
k0   a0   b0   c0   d0   f0   g0
k1   a1   b1   c1  NaN  NaN  NaN
k2   a2   b2   c2   d1   f1   g1
k3   a3   b3   c3  NaN  NaN  NaN
k4  NaN  NaN  NaN   d2   f2   g2
k6  NaN  NaN  NaN   d3   f3   g3

Para evitar los nulos, podr√≠amos simplemente hacer un inner join.

In [21]:
left.join(right, how='inner')

     a   b   c   d   f   g
k0  a0  b0  c0  d0  f0  g0
k2  a2  b2  c2  d1  f1  g1